       identification division.
       program-id. PERFORM-EXAMPLE.

       procedure division.
           perform MENSAJE.
           stop run.
       
       MENSAJE.
           display "Hola".
           